{
    "navigation": {
        "design-h": "Customize to You",
        "design": "Design",
        "guide-h": "Installation Guides",
        "cp-lidar": "Control Panel - LIDAR",
        "cp-pir": "Control Panel - PIR",
        "cp-us": "Control Panel - Ultrasonic",
        "sn-lidar": "Sensor Node - LIDAR",
        "sn-pir": "Sensor Node - PIR",
        "sn-us": "Sensor Node - Ultrasonic"
    },
    "welcome": {
        "title": "Alarms",
        "alarms1": "Alarms are sensor devices that you can assemble from parts. If a server is set up in your neighborhood, the alarms can be used to alert you and your neighbors in the event of a break-in. The alarm devices communicate with the server through",
        "alarms2": "signals, so they function independently of the WiFi in your home.",
        "design": "When setting up alarms, you must first decide which alarms to build and order parts. This is done from the Design section.",
        "install": "When you have all the necessary parts, and your home is registered on the server, you can proceed to install your alarms. Installation Guides are available from the page menu to the left."
    },
    "design":{
        "version": "v1.0",
        "devicetypes0": "There are two types of alarm devices: Control Panels and Sensor Nodes. Both types of devices are outfitted with a sensor and can set off the alarm. Control Panels also have a screen and keypad that you can use to",
        "devicetypes1": "and disarm the house. Additionally, Control Panels have a panic button that you can use to set off the alarm regardless of whether the house is armed or not.",
        "sensors": "A Sensor Node or Control Panel uses one of three sensors: LIDAR, PIR or Ultrasonic. Each sensor has a unique range.",
        "sensortable":{
            "type":"Sensor type",
            "model":"Model",
            "range":"Range",
            "angle":"Detection angle",
            "price":"Price",
            "lidartype":"LIDAR",
            "lidarmodel":"LIDAR-Lite v3",
            "lidarrange":"1-40m",
            "lidarangle":"Singular",
            "lidarprice":"$$$",
            "pirtype":"PIR",
            "pirmodel":"HC-SR505",
            "pirrange":"0-3m",
            "pirprice":"$",
            "ustype":"Ultrasonic",
            "usmodel":"LV-MaxSonar-EZ0",
            "usrange":"0.15-6.45m",
            "usprice":"$$"
        },
        "housedesign0": "You can decide which alarm devices you want to build based on your security needs. When designing your solution, you should include at least one Control Panel to arm the system. Below is an example of an alarm installation using",
        "housedesign1": "LIDAR",
        "housedesign2": ",",
        "housedesign3": "PIR",
        "housedesign4": ", and",
        "housedesign5": "ultrasonic",
        "housedesign6": "sensors indicating the range and width of the detection zones for the different sensors.",
        "deviceformintro": "If you would like to build one or more alarms for your own home, you can compile a list of all the parts needed for your alarm setup below. The list of devices and resulting parts list can be sent in an email for later reference. You can choose to give a device a descriptive name, like \"Living room\" in order to keep track of your alarms during installation and maintenance.",
        "device-form":{
            "add-device": "Add device",
            "build-parts-list": "Build parts list",
            "email-label": "Send list to email:",
            "email-placeholder": "example@address.com",
            "email-send": "Send email"
        },
        "parts-table":{
            "title": "Parts list",
            "amount": "Amount",
            "component": "Component",
            "retailer": "Suggested retailer"
        },
        "outro0":"A Neighborhood Watch Alarm System Server set up in your Neighborhood is necessary for your alarms to function. If there isn't yet a server in your area, please consider building one by visiting",
        "outro1":"the server page",
        "outro2":". Before installation, contact the administrator of your local server and ensure that your house, devices, and phone number are registered. When registering, you need to supply a PIN-code that you will use to arm and disarm your house. Your server administrator will have access to this PIN-code, so please be sure to create a new PIN-code that you do not use for other security-related purposes."
    },
    "guides":{
        "version":"v1.0",
        "cp-title":"Building a Control Panel",
        "cp-intro0":"The basis of a Control Panel is an",
        "cp-intro1":"This device uses the Arduino model Arduino Mega 2560 (as opposed to the smaller, less expensive Arduino UNO used for Sensor Nodes), as only the larger board supplies sufficient memory to run a Control Panel.",
        "lora-title":"1. Arduino and LoRa shield",
        "lora-intro0":"The Arduino needs a",
        "lora-intro1":"with",
        "lora-intro2":"capabilities in order to enable communication between alarm devices and the neighborhood server.",
        "lora-list0":"Attach the antenna to the side of the shield.",
        "lora-list1":"Move the yellow connector marked J_DIO3 by lifting it away from the board and placing it back on only the innermost pin, as seen in the above video.",
        "lora-list2":"Now place the shield on your Arduino, alligning all the connections closest to the end of the Arduino that has plugs.",
        "breadboard-title":"2. Connect a breadboard",
        "breadboard-intro0":"A",
        "breadboard-intro1":"has pins that are connected in two connected outer rows on each side, and half columns in between, as shown in yellow on the below diagram. Plugging a wire into a pin on a row or column connects the wire to all pins on that row/column.",
        "breadboard-intro2":"In order to connect components to the alarm device, you will use a breadboard.",
        "breadboard-list0":"Power the breadboard by connecting the 5V pin on the Arduino to an outer row labeled on the breadboard with a male-to-male wire.",
        "breadboard-list1":"On the same edge of the breadboard, use another wire to connect the second outer row to the ground by a GND pin on the Arduino.",
        "panic-title":"3. Panic button",
        "panic-intro":"A panic button will enable you to activate the alarm at any time.",
        "panic-list0":"Add a push button to the middle area of the breadboard.",
        "panic-list1":"On the breadboard, connect the column of one pin of the push button to the 5V-powered row of the breadboard with a wire.",
        "panic-list2":"On the other end of the push button, connect the column to wire to the A1 pin of the Arduino.",
        "panic-list3-0":"On the same column, add a",
        "panic-list3-1":"that connects to a new column.",
        "panic-list4":"The column containing the second wire of the resistor should be connected to the ground (GND) row of the breadboard.",
        "interface-title":"4. Display and keypad",
        "interface-intro":"Now you are ready to add the interface of the Control Panel: The keypad and the",
        "interface-list0-0":"Take 8",
        "interface-list0-1":"and connect the keypad pins from left to right to the Arduino pins 22-36.",
        "interface-list1":"Dial up the contrast of the LCD by turning the screw-like dial on the back of the LCD about 45 degrees clockwise.",
        "interface-list2":"Connect the GND and VCC pins on the LCD to the power and ground rows of the breadboard with 2",
        "interface-list3":"Using 2 female-to-male wires, connect the SDA and SCL of the LCD to two columns on the breadboard.",
        "interface-list4":"Connect the columns to the corresponding SDA and SCL pins on the Arduino.",
        "cp-basic-outro":"Your Control Panel should now look like the above figure. At this point, all you need to add is a sensor.",
        "cp-lidar-intro":"The LIDAR Control Panel is an alarm device capable of arming and disarming a house, sending a panic notification and sensing movement in a range of 40 meters.",
        "lidar-title":"5. Adding the LIDAR sensor",
        "lidar-intro":"The LIDAR sensor has a long range and a laser-like narrow angle of detection. The LIDAR has more wire connections than needed for this device, so the excess wires are connected to ground.",
        "lidar-list0":"Connect the included wires to the LIDAR.",
        "lidar-list1":"The black wire should connect o the ground row on the breadboard.",
        "lidar-list2":"Connect the blue wire to the SDA column of the breadbpard, and the green wire to SCL.",
        "lidar-list3":"The yellow and orange wires should be connected to ground like the black wire.",
        "lidar-list4":"Connect he red wire to the power row on the breadboard.",
        "cp-hardware-outro":"You have now built an alarm device! Time to install the Control Panel software.",
        "tooltip-explain0":"Expressions shown in",
        "tooltip-explain1":"will display information when you hover your mouse over them.",
        "tab-hardware":"Hardware Setup",
        "next-tab":"Next: ",
        "tab-software":"Software Installation",
        "tab-use-cp":"Using the Control Panel",
        "parts-list":"You will need:",
        "part":{
            "ttn":"TTN Device values provided by your local server administrator",
            "mega":"Arduino Mega 2560",
            "lora":"Dragino LoRa shield for Arduino",
            "keypad":"4x4 Keypad",
            "lcd":"16x2 LCD with I2C interface",
            "breadboard":"breadboard",
            "button":"push button",
            "resistor":"resistor",
            "lidar":"LIDAR-Lite v3 with cables",
            "m2m":"jumper or male-to-male wires",
            "f2m":"female-to-male wires",
            "power":"1 9V power supply OR 1 USB A to B cable and 1 5V wall mount USB adaptor"
        }
    },
    "tooltip":{
        "loraname": "LoRa",
        "loradesc": "Long Range, a low-power wide-area network (LPWAN) protocol.",
        "armname": "arm",
        "armdesc": "When a house is armed, the alarm will be set off when an alarm device in the house senses movement.",
        "arduinoname":"Arduino.",
        "arduinodesc":"An Arduino is a small computer that can run special Arduino software.",
        "shieldname":"shield",
        "shielddesc":"A board that can be plugged on top of an Arduino and extend its capabilities.",
        "breadboardname":"breadboard",
        "breadboarddesc":"A board with interconnected pins that can be used to connect wires without soldering",
        "resistorname": "resistor",
        "resistordesc":"A resistor is an electrical component that reduces electric current. For this device, the resistor enables a clear reading of when the panic button is and isn't pushed.",
        "lcdname":"LCD.",
        "lcddesc":"Liquid Crystal Display, a type of screen.",
        "m2mname":"male-to-male wires",
        "m2mdesc":"Wires that have an outward pin at both ends",
        "f2mname":"female-to-male wires.",
        "f2mdesc":"Wires with an outgoing pin at one end and a plug-like pin at the other end"
        
    }
    
}
