{
    "navigation": {
        "hardware": "Hardware Setup",
        "devices": "Devices",
        "ttnSetup": "The Things Network",
        "raspiSetup": "Raspberry Pi",
        "software": "Software Setup",
        "server": "Server Connection",
        "database": "Database Setup",
        "integration": "Hardware Integration"
    },
    "intro": {
        "title": "Server",
        "version": "The material in this guide is based on the latest version of the system: ",
        "latest": "latest",
        "devices": "The server consist of a <1>Raspberry Pi</1> and a <3>TTN Gateway</3>. The gateway handles the communication back and forward with all the connected devices (<5>visit the alarms section for more info</5>), and the server interprets this passed information. In case of a break in or if a device malfunctions, the server notifices either the entire neighborhood or specific individuals by SMS - depending on the issue.",
        "diagram": "The diagram below shows the general communication flow between the different devices in the overall system, where the TTN cloud and the NWA server house represents what will be referred to as just the server.",
        "server": {
            "description": "To setup your own running server you must first acquire and set up the necessary hardware. Follow the button below for instructions regarding this hardware and their usage. Note that NWA always encourage you to follow the recommended options, unless you are absolutely sure about what you are doing. These guides do not cover alternative methods thoroughly.",
            "link": "Hardware Setup"
        },
        "hardware": {
            "description": "If you have already set up the hardware properply, you're ready to install the necessary software. Follow the button below for instructions on how to setup this software.",
            "link": "Software Setup"
        }
    },
    "devices": {
        "title": "Devices",
        "intro": "The items below represents all the necesarry hardware to get the system up and running. Before moving on to thesetup section, make sure you have acquired all items!",
        "ttnTitle": "TTN Gateway",
        "ttnSection": "To recieve the <1>LoRaWAN</1> signals from the connected alarm systems within the neighborhood, you need a TTN gateway. This can be bought from <3>here</3>.",
        "rasTitle": "Raspberry Pi",
        "rasSection": "You need a simple computer to act as a server that interacts with the information passing through The Things Network. NWA recommends Raspberry Pi 3 B+, as this is the device that the system was developed with, but newer versions should work as well. To power up the Raspberry Pi, you also need a Micro USB cable that can connect to a power outlet. The Raspberry Pi can be bought from <1>here</1>.",
        "sdTitle": "Micro SD Card",
        "sdSection": "As the Raspberry Pi doesn't ship with memory, you need to acquire a compatible Micro SD card. It is a requirement that it has a minimum of 3gb available. You also need a computer that can read Micro SD cards directly or a dongle that enables this functionality. An appropiate memory card can be bought from <1>here</1>.",
        "simIntro": "Huawei Modem + SIM card",
        "simSection": "For the SMS functionality to work, you need an activated SIM card with message sending capabilities. As SIM cards can't be directly inserted into a Raspberry Pi - or barely any computer for that matter - you need a wireless USB modem. NWA recommends the HUAWEI E3372H modem, as this is the device that the system was developed with. Note that different modems might require software alterrations. The HUAWEI modem can be bought from <1>here</1>.",
        "next": "Next: TTN Setup"
    },
    "ttn": {
        "title": "The Things Network Setup",
        "videoIntro": "In the video below TTN guides you through how to setup your Gateway with The Things Network step by step as decribed above.",
        "videoLicense": "The video is embedded as a link to TTN's own Youtube channel and used under Youtube's fair use policy."
    },
    "os": {
        "title": ""
    },
    "connection": {
        "title": ""
    },
    "database": {
        "title": ""
    },
    "integration": {
        "title": ""
    }
}