{
    "navigation": {
        "design-h": "Tilpas din løsning",
        "design": "Design",
        "guide-h": "Installationsvejledninger",
        "cp-lidar": "Kontrolpanel - LIDAR",
        "cp-pir": "Kontrolpanel - PIR",
        "cp-us": "Kontrolpanel - Ultralyd",
        "sn-lidar": "Sensornode - LIDAR",
        "sn-pir": "Sensornode - PIR",
        "sn-us": "Sensornode - Ultralyd"
    },
    "welcome": {
        "title": "Alarmer",
        "alarms1": "Alarmer er sensorapparater, som du kan bygge af hardwarekomponenter. Hvis der er en NWA server sat op i dit nabolag, kan du registerere dine alarmenheder hos serveren, og bruge dem til at advare dig selv og dit nabolag i tilfælde af et indbrud. Alarmenheder kommunikerer med serveren gennem",
        "alarms2": "signaler, så de fungerer uafhængigt at dit hjems WiFi-forbindelse.",
        "design": "Når du laver en alarmopstilling må du først bestemme, hvilke alarmenheder du vil bygge og bestille de fornødne hardwarekomponenter. For at læse mere, kan du besøge Design-siden.",
        "install": "Når du har alle de fornødne komponenter, og har registreret dine alarmenheder på serveren, kan du installere dine alarmenheder i hjemmet. Du finder installationsvejledninger til hver type alarmenhed i menuen til venstre på siden."
    },
    "design":{
        "version": "v1.0",
        "devicetypes0": "En alarmenhed består af basale hardwarekomponenter, og kan bygges hjemme i din stue. Alarmenheden aktiveres, når du installerer NWAs gratis software på din alarmenhed. Der er to typer alarmenheder: Kontrolpaneler og sensornoder. Begge typer enheder har en sensor forbundet, der kan bruges til at opdage indbrud. Kontrolpaneler er også udstyret med en skærm og et numerisk tastatur, og kan bruges til at",
        "devicetypes1": "og desarmere alarmerne i dit hus. Derudover har kontrolpaneler en panikknap, som kan bruges til at starte en alarm uanset, om din husstand er armeret eller ej.",
        "sensors0": "En sensornode og et kontrolpanel kan bruge en af tre sensorer: en",
        "sensors1":"", 
        "sensors2": "eller", 
        "sensors3": " De forskellige sensorer har forskellig rækkevidde.",
        "sensortable":{
            "type":"Sensortype",
            "model":"Komponentmodel",
            "range":"Rækkevidde",
            "angle":"Detekteringsvinkel",
            "price":"Pris",
            "lidartype":"LIDAR",
            "lidarmodel":"LIDAR-Lite v3",
            "lidarrange":"1-40m",
            "lidarangle":"Enkelt",
            "lidarprice":"$$$",
            "pirtype":"PIR",
            "pirmodel":"HC-SR505",
            "pirrange":"0-3m",
            "pirprice":"$",
            "ustype":"Ultralyd",
            "usmodel":"LV-MaxSonar-EZ0",
            "usrange":"0.15-6,45m",
            "usprice":"$$"
        },
        "housedesign0": "Du kan udvælge hvilke alarmenheder, du vil bygge, ud fra din husstands sikkerhedsbehov. Når du designer din sammensætning, bør du inkludere mindst et kontrolpanel, så du kan armere og desarmere huset. Nedenfor ses et eksempel på en alarmopstilling der benytter",
        "housedesign1": "LIDAR",
        "housedesign2": ",",
        "housedesign3": "PIR",
        "housedesign4": " og",
        "housedesign5": "ultralyd",
        "housedesign6": "som sensorer vist i den tilsvarende farve, med sensorernes rækkevidde og detekteringsvinkel illustreret.",
        "deviceformintro": "Hvis du gerne vil bygge én eller flere alarmenheder til din husstand, kan du kompilere en liste af enheder nedenfor. Herfra kan du generere en indkøbsliste af de fornødne komponenter, eller sende listen af alarmenheder og komponenter til din email, så du kan gemme sammensætningen. Mailen vil være på engelsk. Hvis du giver dine enheder beskrivende navne som \"Stue\", kan det hjælpe med at holde overblik over dine enheder under fremtidig installation og vedligehold.",
        "device-form":{
            "add-device": "Tilføj alarmenhed",
            "build-parts-list": "Byg komponentliste",
            "email-label": "Send listen som email:",
            "email-placeholder": "eksempel@addresse.dk",
            "email-send": "Send email"
        },
        "parts-table":{
            "title": "Komponentliste",
            "amount": "Antal",
            "component": "Komponent",
            "retailer": "Foreslået forhandler"
        },
        "outro0":"En NWA server er nødvendig for, at dine alarmenheder kan fungere. Hvis der ikke er en server i dit nabolag endnu, kan du overveje at opsætte en ved at se vejledningen på",
        "outro1":"serversiden",
        "outro2":". Inden du installerer dine alarmenheder, bør du kontakte vedkommende, der administrerer din lokale server og sikre dig, at dine nye enheder er registreret, sammen med dit telefonnummer og en fire-cifret kode, som du vil bruge til at armere og desarmere huset. Server-administratoren vil kunne se din kode, så du bør finde på en kode, som du ikke bruger til andre sikkerhedsrelaterede formål."
    },
    "guides":{
        "version":"v1.0",
        "basic-intro":"Denne hardwarevejledning inkluderer diagrammer efterfulgt af beskrivelser. Informationen i diagrammerne og beskrivelserne er den samme.",
        "cp-title":"Byg kontrolpanelet",
        "cp-intro0":"Grundlaget for et kontrolpanel er en",
        "cp-intro1":"Enheden benytter en Arduino af modellen Mega 2560, frem for den mindre og billigere Arduino UNO brugt i sensornoder, da kun den større model kan levere tilstrækkelig hukommelse til at køre kontrolpanelets software.",
        "sn-title":"Byg sensornoden",
        "sn-intro0":"Grundlaget for en sensornode er en",
        "sn-intro1":"Sensornoden benytter en Arduino af typen Arduino UNO.",
        "lora-title":"1. Arduino og LoRa skjold",
        "lora-intro0":"På Arduinoen skal der påsættes et",
        "lora-intro1":"med",
        "lora-intro2":"funktionalitet for at facilitere kommunikation med serveren.",
        "lora-list0":"Skru den medfølgende på siden af skjoldet.",
        "lora-list1":"Flyt den gule plastik-forbindelse, markeret J_DIO3, ved at løfte den væk fra skjoldet og placere den ned på kun det ene af de stik, der er under, som vist i videoen.",
        "lora-list2":"Placer skjoldet ned ovenpå Arduinoen, så alle tilsvarende stik forbindes i den ende af Arduinoen, der har USB-porte.",
        "lora-list2-sn":"Placer skjoldet ned ovenpå Arduinoen, så alle tilsvarende stik forbindes.",
        "breadboard-title":"2. Forbind et breadboard",
        "breadboard-intro0":"Et",
        "breadboard-intro1":"har stik der er forbundet med hinanden. Stikkene i de to yderrækker øverst og nederst på breadboard-diagrammet er forbundet i rækken, og resten af stikkene er forbundet med hinanden i halve kolonner, som vist i gul på breadboard-diagrammet. Hvis en ledning sættes in i et stik på breadboardet, forbindes ledningen med alle stik på den række/kolonne.",
        "breadboard-intro2":"Et breadboard bruges når komponenter forbindes til alarmenheden.",
        "breadboard-list0":"Forbind strømmen i Arduinoen til breadboardet ved at forbinde en ledning til 5V-stikket på Arduinoen med en af yderrækkerne på breadboardet. Forbind Power the breadboard by connecting the 5V pin on the Arduino to an outer row labeled on the breadboard with a male-to-male wire.",
        "breadboard-list1":"Før en ledning fra Arduinoens GND stik til den anden yderrække på samme ende af breadboardet.",
        "panic-title":"3. Panikknap",
        "panic-intro":"En panikknap lader dig aktivere alarmen i tilfælde af en nødssituation.",
        "panic-list0":"Påsæt en knap på breadboardet.",
        "panic-list1":"Forbind kolonnen, som den ene side af knappen er forbundet til, til breadboardets 5V-strømførende række. En lille ledning vil fungere bedst til denne type forbindelser mellem stikkene på breadboardet, men en længere han-til-han-ledning vil også fungere.",
        "panic-list2":"Fra kolonnen forbundet til den anden ende af knappen, forbind en ledning til Arduinoens Analog 1 stik.",
        "panic-list3-0":"På samme kolonne, indsæt en",
        "panic-list3-1":"der forbinder hen til en ny kolonne.",
        "panic-list4":"Den kolonne, der er forbundet til resistorens nye kolonne, bør forbindes til jordforbindelsen (GND) på breadboardet.",
        "interface-title":"4. Skærm og tastatur",
        "interface-intro":"Nu er du klar til at tilføje en brugergrænseflade til din alarmenhed ved at tilføje et numerisk tastatur og en",
        "interface-list0-0":"Find 8",
        "interface-list0-1":"og forbind tastaturets stik fra venstre mod højre til Arduinoens stik 22-36.",
        "interface-list1":"På bagsiden af LCD’en er er et lille skruehoved, som bør drejes 45 grader med uret for at indstille skærmens kontrast.",
        "interface-list2":"Forbind LCD’ens GND og VCC stik til breadboardet strøm- og jordforbindelse med 2",
        "interface-list3":"Tag 2 han-til-hun-ledninger mere og forbind LCD’ens SDA og SCL-stik til to ubrugte kolonner på breadboardet.",
        "interface-list4":"Forbind de to kolonner til det tilsvarende SDA- og SCL-stik på Arduinoen.",
        "cp-basic-outro":"Dit kontrolpanel bør se ud som på ovenstående diagram. Nu mangler du bare at forbinde en sensor.",
        "sn-basic-outro":"Din sensornode bør se ud som på ovenstående diagram. Nu mangler du bare at forbinde en sensor.",
        "cp-lidar-intro":"LIDAR-kontrolpanelet er en alarmenhed der giver mulighed for at armere og desarmere et hus, sende en panikmelding, samt opfange bevægelse i en rækkevidde af 40 meter.",
        "cp-ultra-intro":"Ultralyds-kontrolpanelet er en alarmenhed der giver mulighed for at armere og desarmere et hus, sende en panikmelding, samt opfange bevægelse i en rækkevidde af over 6 meter.",
        "cp-pir-intro":"PIR-kontrolpanelet er en alarmenhed der giver mulighed for at armere og desarmere et hus, sende en panikmelding, samt opfange bevægelse i en bredvinklet rækkevidde af 3 meter.",
        "sn-lidar-intro":"LIDAR-sensornoden er en alarmenhed der giver mulighed for at opfange bevægelse i en rækkevidde af 40 meter.",
        "sn-ultra-intro":"Ultralyds-sensornoden er en alarmenhed der giver mulighed for at opfange bevægelse i en rækkevidde af over 6 meter.",
        "sn-pir-intro":"PIR-sensornoden er en alarmenhed der giver mulighed for at opfange bevægelse i en bredvinklet rækkevidde af 3 meter.",
        "lidar-title":"5. Tilføj en LIDAR-sensor",
        "lidar-title-sn":"3. Tilføj en LIDAR-sensor",
        "lidar-intro":"LIDAR-sensoren har en lang rækkevidde med en laser-smal detekteringvinkel. LIDARen er udstyret med flere ledninger, end der skal bruges i denne opstilling, og de overskydende ledninger forbindes til jord.",
        "lidar-list0":"Forbind de medfølgende ledninger til LIDARen.",
        "lidar-list1":"Den sorte ledning børe kobles til jordforbindelsen på breadboardet..",
        "lidar-list2":"Forbind den blå ledning til SDA-kolonnen på breadboardet, og den grønne til SCL.",
        "lidar-list2-sn":"Forbind den blå ledning til SDA-stikket på Arduinoen, og den grønne til SCL.",
        "lidar-list3":"De gule og orange ledninger forbindes som den sorte ledning til jord.",
        "lidar-list4":"Forbind den røde ledning til strømrækken på breadboardet.",
        "pir-title":"5. Tilføj en PIR-sensor",
        "pir-title-sn":"3. Tilføj en PIR-sensor",
        "pir-intro":"PIR-sensoren har brug for en resistor i sit kredsløb for at opnå mere pålidelige målinger, da den ellers er overfølsom. I denne opstilling opnås modstanden ved at forbinde en",
        "pir-list0":"Placér MOSFETen mellem tre kolonner på breadboardets halvdel nærmest Arduinoen",
        "pir-list1":"Placér PIR-sensoren på den modsatte halvdel af breadboardet, ud fra MOSFETen.",
        "pir-list2":"Forbind midterste PIR-kolonne med en af yder-kolonnerne på MOSFETen.",
        "pir-list3":"MOSFETens midterkolonne bør forbindes til breadboardets strømrække.",
        "pir-list4":"Fra MOSFETens sidste kolonne forbindes en ledning til Analog 0-stikket på Arduinoen. Fra samme kolonne trækkes en resistor over til en ny kolonne.",
        "pir-list5":"Resistorens nye kolonne forbindes til jordrækken.",
        "ultra-title":"5. Tilføj en ultralydssensor",
        "ultra-title-sn":"2. Tilføj en ultralydssensor",
        "ultra-list0":"Ultralydssensoren har en række små huller, eller stik, langs den ene kant. For at forbinde sensoren skal vi bruge stikkene markeret med GND, +5 og AN. Stikkene forbindes ved at føre lange ledninger med ståltrådsender (af samme type som de små ledninger) gennem de tre stik. Nu bøjes ledningernes ståltråd rundt om kanten på sensoren, så ståltråden bevarer konstant kontakt med stikkets indre kant. Hvis du har adgang til loddeudstyr, bør denne forbindelse loddes.",
        "ultra-list1-sn":"Forbind GND-ledningen med et GND-stik på Arduinoen.",
        "ultra-list1-cp":"Forbind GND-ledningen til jordrækken på breadboardet.",
        "ultra-list2-cp":"Forbind +5-ledningen med strømrækken på breadboardet.",
        "ultra-list2-sn":"+5-ledningen med 5V-stikket på Arduinoen.",
        "ultra-list3":"Den sidste ledning forbindes med Analog 0-stikket på Arduinoen.",
        "cp-hardware-outro":"Du har nu bygget en alarmenhed! Næste trin er at installere kontrolpanelets software.",
        "sn-hardware-outro":"Du har nu bygget en alarmenhed! Næste trin er at installere sensornodens software.",
        "tooltip-explain0":"Din alarmenhed skal samles og have installeret software inden den er klar til brug. Denne vejledningen fører dig gennem den nødvendige trin for at opsætte alarmsystemet: Hardwareopsætning, softwareinstallation, og brugervejledning. Udtryk skrevet med",
        "tooltip-explain1":"vil vise information når du fører musen hen over dem.",
        "tab-hardware":"Hardware opsætning",
        "next-tab":"Næste fane: ",
        "tab-software":"Softwareinstallation",
        "tab-use-cp":"Brug af kontrolpanelet",
        "tab-use-sn":"Brug af sensornoden",
        "parts-list":"Du skal bruge:",
        "part":{
            "ttn":"TTN device-værdier, som du kan få oplyst  af din lokale server-administrator",
            "mega":"Arduino Mega 2560",
            "uno":"Arduino UNO",
            "lora":"Dragino LoRa skjold til Arduino",
            "keypad":"4x4 Keypad",
            "lcd":"16x2 LCD with I2C interface",
            "breadboard":"breadboard",
            "button":"push knap",
            "resistor":"resistor",
            "lidar":"LIDAR-Lite v3 med ledninger",
            "pir":"PIR sensor af modellen HC-SR505",
            "mosfet":"MOSFET",
            "ultra":"ultralydssensor LV-MaxSonar-EZ0",
            "m2m":"han-til-han-ledninger",
            "jump":"små ledninger",
            "f2m":"han-til-hun-ledninger",
            "power":"1 9V strømforsyning eller 1 USB A til B-kabel og 1 5V USB-stikklods"
        },
        "software":{
            "ide-title":"Download og installer redigeringsprogram",
            "ide-intro":"Din alarmenhed har brug for enhedsspecifik NWA-software for at fungere i alarmsystemet.",
            "a-lidar-cp":"Et LIDAR-kontrolpanel",
            "a-pir-cp":"Et PIR-kontrolpanel",
            "a-ultra-cp":"et ultralydskontrolpanel",
            "a-lidar-sn":"En LIDAR-sensornode",
            "a-pir-sn":"En PIR-sensornode",
            "a-ultra-sn":"en ultralydssensornode",
            "list-ttn":"3 TTN-værdier unikke til din alarmenhed. Anmod din server-administrator om at generere værdierne til dig.",
            "list-computer":"En computer med USB-port",
            "list-cable":"Et USB A til B kabel",
            "ide-install0":"Først skal du sørge for at have den officielle",
            "ide-install1":"installeret på din computer. Den kan hentes fra den officielle Arduino-hjemmeside. En",
            "ide-install2":"bruges til at tilpasse og uploade software til din alarmenhed.",
            "new-file":"Når du åbner det installerede Arduinoprogram, åbner den med en ny fil. Filen er en såkaldt sketch-fil, og lagres på din computer med en .ino-endelse. Hvis du allerede har brugt Arduino IDEen og har brug for en ny fil, kan du trykke på ‘New’-knappen øverst i programmet.",
            "cp-code0":"Udskift indholdet af den nye fil med kontrolpanelsoftwarens kildekode ved at kopiere og indsætte indholdet af",
            "cp-code-lidar":"LIDAR Control Panel-kildekoden",
            "cp-code-pir":"PIR Control Panel-kildekoden",
            "cp-code-ultra":"Ultrasonic Control Panel-kildekoden",
            "sn-code0":"Udskift indholdet af den nye fil med sensornodesoftwarens kildekode ved at kopiere og indsætte indholdet af",
            "sn-code-lidar":"LIDAR Sensor Node-kildekoden",
            "sn-code-pir":"PIR Sensor Node-kildekoden",
            "sn-code-ultra":"Ultrasonic Sensor Node-kildekoden",
            "cp-code1":".",
            "lib-title":"Importering af biblioteker",
            "lib-intro0":"Softwaren bruger",
            "lib-intro1":"for at fungere efter hensigten.",
            "lib-ide-title":"Installation of libraries supplied in the IDE",
            "lib-ide-intro0":"In the Arduino IDE, go to the Sketch tab and then to (Include Library -> Manage Libraries).",
            "lib-ide-intro1":"Det vil åbne Library Manager-vinduet, og herfra kan du søge efter, og installere, følgende biblioteker:",
            "lib-by":"by",
            "lib-version":"Version",
            "lib-zip-title":"Installation af tredjepartsbiblioteker fra nettet",
            "lib-zip-siphash0":"Download SipHash-biblioteket (brugt til at kryptere din pinkode) fra",
            "lib-zip-siphash1":"SipHash Library for Arduino-hjemmesiden",
            "lib-zip-siphash2":"ved at klikke (Clone -> Download ZIP) på siden. Notér dig, hvor den downloadet .ZIP-fil ligger på dit system, og installer den fra Arduino IDEen under (Sketch -> Include Library -> Add .ZIP Library).",
            "lib-zip-lmic0":"Download biblioteket Arduino-LMIC (brugt til LoRa-kommunication) fra",
            "lib-zip-lmic1":"Arduino-LMIC GitHub-siden",
            "lib-zip-lmic2":"ved at klikke (Clone -> Download ZIP) på siden. Notér dig, hvor den downloadet .ZIP-fil ligger på dit system, og installer den fra Arduino IDEen under (Sketch -> Include Library -> Add .ZIP Library).",
            "upload-title":"Forbered og upload softwaren",
            "upload-ttn":"På Design-siden blev hver alarmenhed givet et indeks. (1, 2 3 osv.). Din serveradministrator kan registrere dine enheder og forsyne dig med en Network Session Key, App Session Key og Device Address-værdi til hver enhed. Når du har fået disse værdier, kan du finde de tilsvarende værdier i kildekoden (NWKSKEY, APPSKEY og DEVADDR), og definere værdierne. DEVADDR bør have '0x' foran.",
            "upload-save":"Hvis du gerne vil gemme filen, så du senere kan slå op i den, kan du trykke på Save-knappen. Giv gerne filen et navn med enhedsnummeret inkluderet, som f.eks.",
            "upload-board-mega":"I IDEen kan du specificere hvilken model af Arduino, som du bruger: (Tools -> Board -> Arduino Mega or Mega 2560).",
            "upload-board-uno":"I IDEen kan du specificere hvilken model af Arduino, som du bruger: (Tools -> Board -> Arduino UNO).",
            "upload-connect-cp":"Forbind dit kontrolpanel til computeren med USB A til B-kablet, som sættes i stik i Arduinoen. Når enheden er forbundet, vil der tændes en lille pære på Arduinoen. I IDEen skal du nu gå til (Tools -> Port) og vælge den port, hvor der står Arduino Mega or Mega 2560.",
            "upload-connect-sn":"Forbind din sensornode til computeren med USB A til B-kablet, som sættes i stik i Arduinoen. Når enheden er forbundet, vil der tændes en lille pære på Arduinoen. I IDEen skal du nu gå til (Tools -> Port) og vælge den port, hvor der står Arduino/Genuino UNO.",
            "upload-cp":"Med kontrolpanelet forbundet, kan du nu trykke på Upload-knappen. Gå til (Tools->Serial Monitor) for at åbne et vindue med output fra din enhed. Outputtet bør se nogenlunde ud som på billedet nedenfor.",
            "upload-sn":"Med sensornoden forbundet, kan du nu trykke på Upload-knappen. Gå til (Tools->Serial Monitor) for at åbne et vindue med output fra din enhed. Outputtet bør se nogenlunde ud som på billedet nedenfor.",
            "outro-cp":"Nu er dit kontrolpanel klar til brug. Den installerede software vil køre, når enheden er forbundet til strøm",
            "outro-sn":"Nu er din sensornode klar til brug. Den installerede software vil køre, når enheden er forbundet til strøm."
        },
        "use":{
            "sn-intro":"Sensornoden kan, når den er armeret, aktivere en alarm. En alarm aktiveres ved at sende besked til serveren, og kræver derfor, at der er forbindelse dertil. Sensornoden er kun armeret, når et kontrolpanel i huset er blevet brugt til at armere husstanden, og sensornoden har modtaget denne information fra serveren.",
            "power":"Alarmenheden kan få strøm fra en 9V strømforsyning eller et USB A til B-kabel forbundet til en 5V USB-klods. Hvis din enhed skal sikres mod, at strømmen i hjemmet går, kan den også drived fra et 9V batteri.",
            "placement":"Når du placerer alarmenheden i hjemmet, bør den placeres diskret, og om muligt så sensoren er sat fast til en solid flade. Når enheden rykkes, risikerer du, at ledningerne mister forbindelse i stikkene. En ideel placering ville et sted der ikke var i vejen for din daglige gøren og laden, og gerne i en kasse med et hul til sensoren. På den måde er enheden bedre beskyttet mod støv.",
            "alarm": "Når en enhed er armeret og sensoren opfanger bevægelse, vil alarmenheden kommunikere til serveren at alarmen skal aktiveres og SMS-beskeder skal sendes ud til nabolagets medlemmer af alarmsystemet.",
            "calibrate":"Når din alarmenhed starter op, kalibrerer sensoren. Det tager et øjeblik. Enheden er som udgangspunkt desarmeret ved opstart, og hvis dit hus er armeret vil enheden blive det inden for nogle minutter.",
            "restart":"Et sted på Arduino-brættets overflade er der en lille knap. Hvis du strykker på knappen, genstarter Arduinoen og dens software. Hvis en enhed er genstartet mens huset er armeret, vil enheden være desarmere i nogle minutter før den igen armeres.",
            "arm":"Når din alarmenheds LCD viser en mulighed for at taste en pin, og hvorvidt enheden er armeret, desarmeret, eller om alarmen eller panikknappen er aktiveret. For at armere eller desarmere systemet, skal du taste dine fire-ciftret adgangskode efterfulgt af #. Når koden er sendt, viser skærmen en \"Waiting for ack\"-besked for at indikere, at den venter på svar fra serveren. Det kan tage 2-5 minutter at få svar, og din enhed er ikke armeret før svaret modtages. Alle andre aktive alarmenheder bliver derefter armeret inden for nogle minutter. Hvis \"Waiting for ack\"-beskeden stadig står der efter 10 minutter, kan der være et problem med serverforbindelsen eller koden. Genstart da alarmenheden og kontakt serverens administrator. Hvis skærmen har en løs forbindelse, bliver teksten på skærmen ikke genoprettet når forbindelsen genfindes. Det kan løses ved at genstarte Arduinoen.",
            "panic":"Du kan aktivere panikknappen uagtet af, om din husstand er armeret. Serveren vil da meddele dit nabolag om et potentielt nødstilfælde.",
            "interval-cp":"Bemærk at alarmenheder kommunikerer med serveren ved et regelmæssigt interval af nogle få minutter. Det gælder også information om alarmen, panikknappen, og armering ved indtastning af kode. Hvis din alarmenhed bliver genstartet inden for dette interval, sender den ikke informationen.",
            "interval-sn":"Bemærk at alarmenheder kommunikerer med serveren ved et regelmæssigt interval af nogle få minutter. Det gælder også information om hvorvidt alarmen skal aktiveres. Hvis din alarmenhed bliver genstartet inden for dette interval, sender den ikke informationen.",
            "offline":"Hvis en alarmenhed stopper med at kommunikere med serveren, vil serveren reagere på det. Hvis dit hus er armeret, vil alarmen gå af. Ellers vil kun du modtage en SMS om din enheds status."
        }
    },
    "tooltip":{
        "lidarname":"LIDAR,",
        "lidardesc":"En LIDAR måler afstand ved at udsende laser-agtige bølger, og måle på de bølger, der reflekteres af et objekt i detekterinsområdet. Hvis en person eller objekt bevæger sig inden for sensorens rækkevidde, vil den målte afstand ændre sig.",
        "pirname":"PIR",
        "pirdesc":"En PIR-sensor måler infrarød stråling, som udsendes af personer og genstande. Hvis en person bevæger sig inden for sensorens detekteringsområde, vil sensoren måle en ændring i strålingen.",
        "ultraname":"ultralydssensor.",
        "ultradesc":"En ultralydssensor udsender ultralydsbølger, og måler den lyd der bliver reflekteret for at bestemme afstanden til det nærmeste objekt i detekteringsområdet. Når en person eller objekt går ind i dens rækkevidde, vil denne afstand forandres.",
        "tooltipname":"grå",
        "tooltipdesc":"Hej jeg er et tooltip!",
        "loraname": "LoRa-",
        "loradesc": "Long Range, en ‘low-power wide-area’ netværks(LPWAN)-protokol.",
        "armname": "armere",
        "armdesc": "Når et hus er armeret, vil alarmen aktiveres når en enhed i huset opfanger bevægelse.",
        "arduinoname":"Arduino.",
        "arduinodesc":"En Arduino er en lille computer, der kan køre særlig Arduino software.",
        "shieldname":"skjold",
        "shielddesc":"Et board der kan kobles oven på arduinoen of udvidede dens funktionalitet.",
        "breadboardname":"breadboard",
        "breadboarddesc":"Et board med sammenkoblet stik, der kan blive brugt til at forbinde kabler uden brug af lodning.",
        "mosfetnname":"MOSFET.",
        "mosfetdesc":"En MOSFET er en transistor der kan agere ventil mellem to tilslutninger. Ventilen er kontrolleret af en tredje tilslutning til MOSFETen.",
        "resistorname": "resistor",
        "resistordesc":"En resistor er en elektrisk komponent, der øger modstand. I denne opstilling giver resistoren en klar læsning af, hvornår panik knappen er aktiveret og deaktiveret.",
        "lcdname":"LCD.",
        "lcddesc":"Liquid Crystal Display (flydende krystalskærm), en slags skærm.",
        "m2mname":"han-til-han-kabler",
        "m2mdesc":"Ledninger med udadgående stik i begge ender.",
        "f2mname":"han-til-hun-kabler.",
        "f2mdesc":"Ledninger med udadgående stik i en ende og indadgående/modtagende stik i den anden ende.",
        "idename":"IDE",
        "idedesc":"Et Integrated Development Environment (integreret udviklingsmiljø) bruges til at redigere i kildekode.",
        "libname":"biblioteker",
        "libdesc":"Inden for software er biblioteker en samling filer, der kan blive refereret til i kode."
    }
}


